brew "antigen"
brew "gcc"
brew "gh"
brew "htop"
brew "httpie"
brew "mas"
brew "starship"
brew "stow"
brew "unzip"
brew "wget"
brew "zsh"

if RUBY_PLATFORM.include? "darwin"
  cask "android-studio"
  cask "docker-desktop"
  cask "font-hack-nerd-font"
  cask "visual-studio-code"
  cask "github-copilot-for-xcode"
  cask "github"
  mas "1Password for Safari", id: 1569813296
  mas "Developer", id: 640199958
  mas "Grammarly for Safari", id: 1462114288
  mas "Logic Pro", id: 634148309
  mas "Microsoft Excel", id: 462058435
  mas "Microsoft Rewards for Safari", id: 6443944644
  mas "TestFlight", id: 899247664
  mas "Xcode", id: 497799835
  vscode "github.copilot"
  vscode "github.copilot-chat"
  vscode "ms-vscode-remote.remote-containers"
  vscode "firefox-devtools.vscode-firefox-debug"
end
