brew "gcc"
brew "antigen"
brew "composer"
brew "docker-compose" if system "uname | grep -q Linux"
brew "httpie"
brew "nvm"
brew "starship"
brew "nano"
brew "vim"
brew "mysql-client", link: true, conflicts_with: ["mysql"]
brew "htop"
brew "jq"
brew "tmux"
brew "cmake"
brew "wget"
brew "git"
brew "cocoapods" if system "uname | grep -q Darwin"
brew "gh"
brew "glow"
